<a href="https://colab.research.google.com/github/dianakang/DIANA_Pandas/blob/master/Do_it_Pandas_5_%EB%8D%B0%EC%9D%B4%ED%84%B0%EC%97%B0%EA%B2%B0%ED%95%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 목차

*   4.1. 데이터 시각화가 필요한 이유
*   4.1.1. 앤스콤 4분할 그래프 살펴보기
*   4.1.2. 앤스콤 데이터 집합으로 그래프 만들기

---

*   4.2. matplotlib 라이브러리 사용하기
*   4.2.1. 기초 그래프 그리기
   *   (1) 히스토그램(Histogram)
   *   (2) 산점도 그래프(Scatter plot)
   *   (3) 박스 그래프(Box plot)
---

*   4.3. seaborn 라이브러리 사용하기
*   4.3.1. 단변량 그래프 그리기
   *   (1) 히스토그램 + 밀집도 그래프
   *   (2) 히스토그램
   *   (3) 밀집도 그래프
   *   (4) 히스토그램 + 밀집도 그래프 + 양탄자 그래프
   *   (5) count 그래프

---

*   4.3.2. 이변량 그래프 그리기
   *   (1) 산점도 그래프
   *   (2) 산점도 그래프 + 히스토그램
   *   (3) 육각 그래프 + 히스토그램
   *   (4) 밀집도 그래프
   *   (5) 바 그래프
   *   (6) 박스 그래프
   *   (7) 바이올린 그래프
   *   (8) 관계 그래프

---

*   4.3.3 다변량 그래프 그리기
   *   (1) 색상 추가하기
   *   (2) 크기와 모양 조절하기
   *   (3) 점을 다른 기호로 표현하기
   *   (4) 그래프 한 번에 그리기 - lmplot 메서드 이용
   *   (5) 그래프 한 번에 그리기 - FacetGrid 클래스 이용

---

*   4.4. 데이터프레임과 시리즈로 그래프 그리기
   *   (1) 히스토그램
   *   (2) 밀집도 그래프
   *   (3) 산점도 그래프
   *   (4) 육각 그래프
   *   (5) 박스 그래프

---

*   4.5. seaborn 라이브러리로 그래프 스타일 설정하기

---
---

# 5. 데이터 연결하기

이번 챕터에서는 '분석하기 좋은 데이터 집합'을 만들기 위해 여러 개의 데이터 집합을 연결하거나 추출하여 데이터를 정리하는 방법에 대해 알아보겠다.

## 5.1. 분석하기 좋은 데이터

분석하기 좋은 데이터란 데이터 집합을 분석하기 좋은 상태로 만들어 놓은 데이터를 말한다. 

데이터 분석 단계에서 데이터 정리는 아주 중요하다. 

실제로 데이터 분석 작업의 70% 이상을 차지하고 있는 작업이 데이터 정리 작업이라고 해도 과언이 아니다.

분석하기 좋은 데이터, 즉 Tidy Data의 조건은 다음과 같다.


*   깔끔한 데이터(Tidy Data)의 조건
  *   데이터의 분석 목적에 맞는 데이터를 모아 새로운 표(Table)를 만들어야 한다.
  *   측정한 값은 행(row)을 구성해야 한다.
  *   변수는 열(column)로 구성해야 한다.

*   깔끔한 데이터는 데이터 연결에서 시작된다!

예를 들어, 주식 데이터를 분석하는 과정에서 '기업 정보'가 있는 데이터 집합과 '주식 가격'이 있는 데이터 집합이 있을 때 '첨단 산업 기업의 주식 가격에 대한 데이터'를 보려면 어떻게 해야할까?


---

STEP1. 일단 '기업 정보'에서 첨단 기술을 가진 기업을 찾아야 한다.

STEP2. 그리고 이 기업들의 '주식 가격'을 찾아본다.

STEP3. 그런 다음 찾아낸 2개의 데이터를 연결하면 된다.

---

이처럼 데이터 집합은 연관성이 깊은 값끼리 모여 있기 때문에, 데이터 연결을 통해 필요한 데이터를 만드는 과정은 반드시 필요하다.

그럼 이제 실습을 통해 데이터 연결을 하는 방법을 알아보자!

## 5.2. 데이터 연결 기초

### 5.2.1. 데이터 연결하기

In [ ]:
# 데이터 불러오기
import pandas as pd

df1 = pd.read_csv('/content/drive/MyDrive/pandas/doit_pandas-master/data/concat_1.csv')
df2 = pd.read_csv('/content/drive/MyDrive/pandas/doit_pandas-master/data/concat_2.csv')
df3 = pd.read_csv('/content/drive/MyDrive/pandas/doit_pandas-master/data/concat_3.csv')

**데이터를 연결**하기 위해서는 **concat 메서드**에 연결하려는 데이터프레임을 리스트에 담아 전달한다.

df1, df2, df3 데이터들은 열의 이름이 모두 A,B,C,D로 같기 때문에 데이터프레임을 연결한 다음에도 열이 그대로 유지된다.

In [ ]:
# 데이터 연결하기
row_concat = pd.concat([df1, df2, df3])
print(row_concat)

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

이제 데이터프레임에서 행 데이터를 추출해보자. concat 메서드는 전달받은 리스트의 요소 순서대로 데이터를 연결한다.

그래서 데이터프레임에 있던 인덱스도 그대로 유지된다. 다음은 데이터프레임에서 네 번째 행을 추출한 것이다.

In [ ]:
# 연결한 데이터 프레임의 네 번째 행 추출
print(row_concat.iloc[3, ])

A    a3
B    b3
C    c3
D    d3
Name: 3, dtype: object

이번에는 데이터프레임에 시리즈를 추가해보자. 먼저 리스트를 시리즈로 변환한다.

In [ ]:
# 데이터프레임에 시리즈 연결하기
new_row_series = pd.Series(['n1','n2','n3','n4'])

그럼 이제 concat 메서드로 데이터프레임과 시리즈를 연결해보자. 시리즈가 **새로운 '열'로 추가**된다. *(새로운 행으로 추가되지 않으니, 혼동하지 말자!)*

그 결과, NaN(누락값)이 많이 생겼다.

In [ ]:
print(pd.concat([df1, new_row_series]))

     A    B    C    D    0
0   a0   b0   c0   d0  NaN
1   a1   b1   c1   d1  NaN
2   a2   b2   c2   d2  NaN
3   a3   b3   c3   d3  NaN
0  NaN  NaN  NaN  NaN   n1
1  NaN  NaN  NaN  NaN   n2
2  NaN  NaN  NaN  NaN   n3
3  NaN  NaN  NaN  NaN   n4

시리즈를 데이터프레임의 새로운 '행'으로 연결하려고 하면 제대로 되지 않는다. 이유가 무엇일까?

시리즈에는 열 이름이 없기 때문이다. 그래서 시리즈를 새로운 열로 갅하여 0이라는 이름의 열로 추가한 것이다.

### 5.2.2. 행 1개로 구성된 데이터프레임 생성하여 연결하기

시리즈는 행이 1개인 데이터프레임이라고 생각해도 된다. 

다음은 1개의 행을 가지는 데이터프레임을 생성하여 df1에 연결한 것이다.

In [ ]:
# 첫번째 방법 - concat 메서드 사용하여 연결하기 (시리즈 생성)

new_row_df = pd.DataFrame([['n1','n2','n3','n4']], columns=['A','B','C','D'])
print(new_row_df)

print("-"*30)


print(pd.concat([df1, new_row_df]))

    A   B   C   D
0  n1  n2  n3  n4
------------------------------
    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

concat 메서드는 한 번에 2개 이상의 데이터프레임을 연결할 수 있는 메서드이다.

만약 연결할 데이터프레임이 1개라면 append 메서드를 사용해도 된다.

In [ ]:
# 두번째 방법 - append 메서드 사용하여 연결하기 (데이터프레임 생성)

df1.append(new_row_df)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

**append 메서드와 딕셔너리를 사용하면 더욱 편하게 행을 연결**할 수 있다.

!! 이때 **ignore_index를 True로 설정**하면 데이터를 연결한 다음 **데이터프레임의 인덱스를 0부터 다시 지정**한다.

In [ ]:
data_dict = {'A':'n1', 'B':'n2', 'C':'n3', 'D':'n4'}
df1.append(data_dict, ignore_index=True)  ## ignore_index=True -> 데이터프레임의 인덱스 0부터 다시 지정 
                                         ## 마지막 행 데이터의 인덱스가 0에서 4로 바뀜.

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  n1  n2  n3  n4

### 5.2.3. 다양한 방법으로 데이터 연결하기

판다스는 데이터를 연결하는 다양한 방법을 제공한다.

In [ ]:
# ignore_index 인자 사용하기 -> 인덱스를 0부터 다시 시정
row_concat_i = pd.concat([df1, df2, df3], ignore_index=True)
row_concat_i

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

만약 행 방향이 아니라 **열 방향으로 데이터를 연결**하려면 어떻게 해야 할까?

**concat 메서드의 axis 인자를 1로 지정**하면 된다. (참고! axis의 기본값은 0이다.)

다음은 df1,df2,df3을 열 방향으로 연결한 것이다.

In [ ]:
col_concat = pd.concat([df1, df2, df3], axis=1) ## axis=1 => 열 방향 데이터 연결
col_concat

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

만약 같은 열 이름이 있는 데이터프레임에서 열 이름으로 데이터를 추출하면 해당 열 이름의 데이터를 모두 추출한다.

In [ ]:
# 같은 열 이름 데이터만 추출
col_concat['A']

    A   A    A
0  a0  a4   a8
1  a1  a5   a9
2  a2  a6  a10
3  a3  a7  a11

In [ ]:
# 새로운 열 추가
col_concat['new_col_list'] = ['n1','n2','n3','n4']
col_concat

    A   B   C   D   A   B   C   D    A    B    C    D new_col_list
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8           n1
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9           n2
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10           n3
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11           n4

앞선 과정에서 데이터프레임의 열 이름을 유지한 채 연결했기 때문에 열 이름이 중복되었다.

다음은 ignore_index를 True로 지정하여 열 이름을 다시 지정한 것이다.

이렇게 하면, 열 이름이 ABCDABCDABCD -> 인덱스 순서 로 바뀐다.

In [ ]:
# ignore_index=True로 열 이름 다시 지정
pd.concat([df1, df2, df3], axis=1, ignore_index=True)

   0   1   2   3   4   5   6   7    8    9    10   11
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

만약 열 이름의 일부가 서로 다른 데이터프레임을 연결하면 어떻게 될까?

앞에서 사용한 df1, df2, df3의 열 이름을 다시 지정해보겠다.

In [ ]:
df1.columns =['A','B','C','D']
df2.columns =['E','F','G','H']
df3.columns =['A','C','F','H']
print(df1)
print(type(df1))

print("-"*50)

print(df2)
print(type(df2))

print("-"*50)

print(df3)
print(type(df3))

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
<class 'pandas.core.frame.DataFrame'>
--------------------------------------------------
    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7
<class 'pandas.core.frame.DataFrame'>
--------------------------------------------------
     A    C    F    H
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11
<class 'pandas.core.frame.DataFrame'>

그 다음 새롭게 열 이름을 부여한 데이터프레임 3개를 concat 메서드로 연결해보겠다.

열 이름이 정렬되며 연결되었다.

그리고 데이터프레임에 없는 열 이름의 데이터는 누락값으로 처리되었다.

In [ ]:
row_concat = pd.concat([df1, df2, df3])
row_concat

     A    B    C    D    E    F    G    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   a4   b4   c4   d4
1  NaN  NaN  NaN  NaN   a5   b5   c5   d5
2  NaN  NaN  NaN  NaN   a6   b6   c6   d6
3  NaN  NaN  NaN  NaN   a7   b7   c7   d7
0   a8  NaN   b8  NaN  NaN   c8  NaN   d8
1   a9  NaN   b9  NaN  NaN   c9  NaN   d9
2  a10  NaN  b10  NaN  NaN  c10  NaN  d10
3  a11  NaN  b11  NaN  NaN  c11  NaN  d11

위의 출력 결과를 보면, 데이터프레임에 없는 열 이름의 데이터는 누락값(NaN)으로 처리되었음을 알 수 있다.

**누락값 없이 데이터를 연결하기 위해서는 데이터프레임의 공통 열만 골라 연결하면 된다.**

**이를 위해서는 join 인자를 inner로 지정해야 한다.**

하지만 아쉽게도 df1, df2, df3은 공통 열이 없다.

In [ ]:
#  누락값(NaN) 출력 안되는 데이터 연결 - join='inner' 사용
pd.concat([df1, df2, df3], join='inner')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3]

---

따라서 세 데이터프레임의 공통 열을 연결한 결과값으로 

Empty DataFrame

columns: []

Index: [0,1,2,3,0,1,2,3,0,1,2,3,]

이 출력된다.

---



---

이번에는 df1과 df3의 공통 열만 골라서 연결해보자.

그러면 공통 열인 A와 C만 연결이 되는 것을 볼 수 있다.

참고로 ignore_index를 False로 설정했기 때문에 열 이름은 새로 지정되지 않고 있다.

In [ ]:
pd.concat([df1, df3], ignore_index=False, join='inner')

     A    C
0   a0   c0
1   a1   c1
2   a2   c2
3   a3   c3
0   a8   b8
1   a9   b9
2  a10  b10
3  a11  b11

이번에는 데이터프레임을 행 방향으로 연결해보자.

우선 df1, df2, df3의 인덱스를 다시 지정해볼 것이다.

In [ ]:
# 데이터 프레임 생성 후 확인
df1.index = [0,1,2,3]
df2.index = [4,5,6,7]
df3.index = [0,2,5,7]

print(df1)
print("-"*50)

print(df2)
print("-"*50)

print(df3)
print("-"*50)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
--------------------------------------------------
    E   F   G   H
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7
--------------------------------------------------
     A    C    F    H
0   a8   b8   c8   d8
2   a9   b9   c9   d9
5  a10  b10  c10  d10
7  a11  b11  c11  d11
--------------------------------------------------

In [ ]:
# concat 메서드로 데이터 연결하기 
col_concat = pd.concat([df1, df2, df3], axis=1)
col_concat

     A    B    C    D    E    F    G    H    A    C    F    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN   a8   b8   c8   d8
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN   a9   b9   c9   d9
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   a4   b4   c4   d4  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN   a5   b5   c5   d5  a10  b10  c10  d10
6  NaN  NaN  NaN  NaN   a6   b6   c6   d6  NaN  NaN  NaN  NaN
7  NaN  NaN  NaN  NaN   a7   b7   c7   d7  a11  b11  c11  d11

In [ ]:
pd.concat([df1, df3], axis=1, join='inner')

    A   B   C   D   A   C   F   H
0  a0  b0  c0  d0  a8  b8  c8  d8
2  a2  b2  c2  d2  a9  b9  c9  d9


---

*   외부 조인과 내부 조인

  *   내부 조인(Inner Join)

  : 둘 이상의 데이터프레임에서 조건에 맞는 행을 연결하는 것이다.


  *   외부 조인(Outer Join)

  : 외부 조인은 두 데이터프레임 중 어떤 데이터프레임을 기준으로 할 것이지에 따라 **왼쪽 외부 조인(Left  Outer Join)**과 **오른쪽 외부 조인(Right Outer Join)**, **완전 외부 조인(Full Outer Join)**으로 나눌 수 있다. 

  왼쪽 외부 조인은 데이터프레임을 연결할 때 왼쪽 데이터프레임을 모두 포함하여 연결하는 것이고,
오른쪽 외부 조인은 데이터프레임을 연결할 때 오른쪽 데이터프레임을 모두 포함하여 연결하는 것이다.
완전 외부조인은 왼쪽과 오른쪽 데이터프레임을 모두 포함하여 연결한다.

## 5.3. 데이터 연결 마무리

판다스는 데이터 연결 전용 메서드인 merge도 제공한다.

In [ ]:
person = pd.read_csv('/content/drive/MyDrive/pandas/doit_pandas-master/data/survey_person.csv')
site = pd.read_csv('/content/drive/MyDrive/pandas/doit_pandas-master/data/survey_site.csv')
survey = pd.read_csv('/content/drive/MyDrive/pandas/doit_pandas-master/data/survey_survey.csv')
visited = pd.read_csv('/content/drive/MyDrive/pandas/doit_pandas-master/data/survey_visited.csv')

print(person)
print("-"*50)

print(site)
print("-"*50)

print(visited)
print("-"*50)

print(survey)
print("-"*50)

      ident   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth
--------------------------------------------------
    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40
--------------------------------------------------
   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22
--------------------------------------------------
    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25
--------------------------------------------------

In [ ]:
# visited 데이터의 일부만 떼어 visited_subset 변수로 지정
visited_subset = visited.loc[[0,2,6], ]

merge 메서드는 **기본적으로 내부 조인**(*누락값 없애기)을 실행하며 메서드를 사용한 데이터프레임(site)을 왼쪽으로 지정하고, 첫번째 인자값으로 지정한 데이터프레임(visited_subset)을 오른쪽으로 지정한다.

left_on, right_on 인자는 값이 일치해야할 왼쪽과 오른쪽 데이터프레임의 열을 지정한다.

즉, 왼쪽 데이터프레임(site)의 열(name)과 오른쪽 데이터프레임(visited)의 열(site)의 값이 일치하면 왼쪽 데이터프레임을 기준으로 연결한다.

In [ ]:
# site와 visited_subset 연결
o2o_merge = site.merge(visited_subset, left_on='name', right_on='site')  ## visited_subset 변수는 위에서 설정했음
o2o_merge

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
2  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

In [ ]:
# site와 visited 데이트프레임 연결
m2o_merge = site.merge(visited, left_on='name', right_on='site')
m2o_merge

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-1 -49.85 -128.57    622   DR-1  1927-02-10
2   DR-1 -49.85 -128.57    844   DR-1  1932-03-22
3   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
4   DR-3 -47.15 -126.72    735   DR-3  1930-01-12
5   DR-3 -47.15 -126.72    751   DR-3  1930-02-26
6   DR-3 -47.15 -126.72    752   DR-3         NaN
7  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

In [ ]:
# person, survey 데이터프레임 연결 /  visited, survey 데이터프레임 연결
ps = person.merge(survey, left_on='ident', right_on='person')
vs = visited.merge(survey, left_on='ident', right_on='taken')

print(ps)
print("-"*50)
print(vs)

   ident   personal   family  taken person quant  reading
0   dyer    William     Dyer    619   dyer   rad     9.82
1   dyer    William     Dyer    619   dyer   sal     0.13
2   dyer    William     Dyer    622   dyer   rad     7.80
3   dyer    William     Dyer    622   dyer   sal     0.09
4     pb      Frank  Pabodie    734     pb   rad     8.41
5     pb      Frank  Pabodie    734     pb  temp   -21.50
6     pb      Frank  Pabodie    735     pb   rad     7.22
7     pb      Frank  Pabodie    751     pb   rad     4.35
8     pb      Frank  Pabodie    751     pb  temp   -18.50
9   lake   Anderson     Lake    734   lake   sal     0.05
10  lake   Anderson     Lake    751   lake   sal     0.10
11  lake   Anderson     Lake    752   lake   rad     2.19
12  lake   Anderson     Lake    752   lake   sal     0.09
13  lake   Anderson     Lake    752   lake  temp   -16.00
14  lake   Anderson     Lake    837   lake   rad     1.46
15  lake   Anderson     Lake    837   lake   sal     0.21
16   roe  Valentina  Roerich    752    roe   sal    41.60
17   roe  Valentina  Roerich    837    roe   sal    22.50
18   roe  Valentina  Roerich    844    roe   rad    11.25
--------------------------------------------------
    ident   site       dated  taken person quant  reading
0     619   DR-1  1927-02-08    619   dyer   rad     9.82
1     619   DR-1  1927-02-08    619   dyer   sal     0.13
2     622   DR-1  1927-02-10    622   dyer   rad     7.80
3     622   DR-1  1927-02-10    622   dyer   sal     0.09
4     734   DR-3  1939-01-07    734     pb   rad     8.41
5     734   DR-3  1939-01-07    734   lake   sal     0.05
6     734   DR-3  1939-01-07    734     pb  temp   -21.50
7     735   DR-3  1930-01-12    735     pb   rad     7.22
8     735   DR-3  1930-01-12    735    NaN   sal     0.06
9     735   DR-3  1930-01-12    735    NaN  temp   -26.00
10    751   DR-3  1930-02-26    751     pb   rad     4.35
11    751   DR-3  1930-02-26    751     pb  temp   -18.50
12    751   DR-3  1930-02-26    751   lake   sal     0.10
13    752   DR-3         NaN    752   lake   rad     2.19
14    752   DR-3         NaN    752   lake   sal     0.09
15    752   DR-3         NaN    752   lake  temp   -16.00
16    752   DR-3         NaN    752    roe   sal    41.60
17    837  MSK-4  1932-01-14    837   lake   rad     1.46
18    837  MSK-4  1932-01-14    837   lake   sal     0.21
19    837  MSK-4  1932-01-14    837    roe   sal    22.50
20    844   DR-1  1932-03-22    844    roe   rad    11.25

**left_on, right_on에 전달하는 값은 여러 개여도 상관이 없다.**

다음은 ps 데이터프레임의 ident, taken, quant, reading 열의 값과, vs 데이터프레임의 person, ident, quant, reading 열의 값을 이용하여 ps와 vs 데이터프레임을 서로 연결한 것이다.

In [ ]:
ps_vs = ps.merge(vs, left_on=['ident', 'taken', 'quant', 'reading'], right_on=['person','ident','quant','reading'])

위에서 연결한 ps_vs 데이터프레임의 첫번째 행을 살펴보면, 양쪽 데이터프레임에 있었던 중복된 열 이름(ident, taken, person)에 접미사 _x, _y가 추가되어 있는 것을 알 수 있다.

_x는 왼쪽 데이터프레임의 열을 의미하고, _y는 오른쪽 데이터프레임의 열을 의미한다.

In [30]:
ps_vs

   ident_x   personal   family  taken_x  ...   site       dated  taken_y  person_y
0     dyer    William     Dyer      619  ...   DR-1  1927-02-08      619      dyer
1     dyer    William     Dyer      619  ...   DR-1  1927-02-08      619      dyer
2     dyer    William     Dyer      622  ...   DR-1  1927-02-10      622      dyer
3     dyer    William     Dyer      622  ...   DR-1  1927-02-10      622      dyer
4       pb      Frank  Pabodie      734  ...   DR-3  1939-01-07      734        pb
5       pb      Frank  Pabodie      734  ...   DR-3  1939-01-07      734        pb
6       pb      Frank  Pabodie      735  ...   DR-3  1930-01-12      735        pb
7       pb      Frank  Pabodie      751  ...   DR-3  1930-02-26      751        pb
8       pb      Frank  Pabodie      751  ...   DR-3  1930-02-26      751        pb
9     lake   Anderson     Lake      734  ...   DR-3  1939-01-07      734      lake
10    lake   Anderson     Lake      751  ...   DR-3  1930-02-26      751      lake
11    lake   Anderson     Lake      752  ...   DR-3         NaN      752      lake
12    lake   Anderson     Lake      752  ...   DR-3         NaN      752      lake
13    lake   Anderson     Lake      752  ...   DR-3         NaN      752      lake
14    lake   Anderson     Lake      837  ...  MSK-4  1932-01-14      837      lake
15    lake   Anderson     Lake      837  ...  MSK-4  1932-01-14      837      lake
16     roe  Valentina  Roerich      752  ...   DR-3         NaN      752       roe
17     roe  Valentina  Roerich      837  ...  MSK-4  1932-01-14      837       roe
18     roe  Valentina  Roerich      844  ...   DR-1  1932-03-22      844       roe

[19 rows x 12 columns]

In [ ]:
ps_vs.loc[0, ]

ident_x           dyer
personal       William
family            Dyer
taken_x            619
person_x          dyer
quant              rad
reading           9.82
ident_y            619
site              DR-1
dated       1927-02-08
taken_y            619
person_y          dyer
Name: 0, dtype: object

이번 5장에서는 데이터를 연결하는 다양한 방법을 알아보았다. 특히 누락값과 중복값을 해결하기 위한 여러 가지 방법에 대해 알아보았다. 

누락값과 중복값은 데이터 분석을 방해하는 요소하기에 잘 해결하는 것이 중요하다.

앞선 서두에서 언급했던 깔끔한 데이터의 조건 중 하나인 '데이터 분석 목적에 맞는 데이터를 모아 새로운 표(Table)를 만들어야한다.'는 바로 누락값이나 중복값이 없는 상태로 데이터가 잘 연결되어 있어야 한다는 말이다!